## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_firewall.virtual_wan_fw01 will be created
  + resource "azurerm_firewall" "virtual_wan_fw01" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-vwan-fw01"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + sku_name            = "AZFW_Hub"
      + sku_tier            = "Premium"
      + threat_intel_mode   = (known after apply)

      + virtual_hub {
          + private_ip_address  = (known after apply)
          + public_ip_addresses = (known after apply)
          + public_ip_count     = 1
          + virtual_hub_id      = (known after apply)
        }
    }

  # azurerm_firewall_policy.fw-pol01 will be created
  + resource "azurerm_firewall_policy" "fw-pol01" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus2"
      + name                     = "fw-pol01"
      + resource_group_name      = "accern-nwsvcs-prd-eus2-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = (known after apply)
      + threat_intelligence_mode = "Alert"
    }

  # azurerm_firewall_policy_rule_collection_group.region1-policy1 will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "region1-policy1" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-pol01-rules"
      + priority           = 100

      + network_rule_collection {
          + action   = "Allow"
          + name     = "network_rules1"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "network_rule_collection1_rule1"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                  + "ICMP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
    }

  # azurerm_virtual_hub.virtual_hub will be created
  + resource "azurerm_virtual_hub" "virtual_hub" {
      + address_prefix                         = "10.200.0.0/22"
      + default_route_table_id                 = (known after apply)
      + hub_routing_preference                 = "ExpressRoute"
      + id                                     = (known after apply)
      + location                               = "eastus2"
      + name                                   = "acn-virtual-hub-prd"
      + resource_group_name                    = "accern-nwsvcs-prd-eus2-rg"
      + virtual_router_asn                     = (known after apply)
      + virtual_router_auto_scale_min_capacity = 2
      + virtual_router_ips                     = (known after apply)
      + virtual_wan_id                         = (known after apply)
    }

  # azurerm_virtual_hub_connection.spoke_aks_vhub will be created
  + resource "azurerm_virtual_hub_connection" "spoke_aks_vhub" {
      + id                        = (known after apply)
      + internet_security_enabled = false
      + name                      = "spoke-aks-vhub"
      + remote_virtual_network_id = (known after apply)
      + virtual_hub_id            = (known after apply)

      + routing (known after apply)
    }

  # azurerm_virtual_hub_routing_intent.fw_routing_intent will be created
  + resource "azurerm_virtual_hub_routing_intent" "fw_routing_intent" {
      + id             = (known after apply)
      + name           = "acn-routingintent"
      + virtual_hub_id = (known after apply)

      + routing_policy {
          + destinations = [
              + "Internet",
            ]
          + name         = "InternetTrafficPolicy"
          + next_hop     = (known after apply)
        }
    }

  # azurerm_virtual_wan.virtual_wan will be created
  + resource "azurerm_virtual_wan" "virtual_wan" {
      + allow_branch_to_branch_traffic    = true
      + disable_vpn_encryption            = false
      + id                                = (known after apply)
      + location                          = "eastus2"
      + name                              = "acn-virtual-wan-prd"
      + office365_local_breakout_category = "None"
      + resource_group_name               = "accern-nwsvcs-prd-eus2-rg"
      + type                              = "Standard"
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["aks_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.16.1.128/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-aks"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["appgw_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.16.1.0/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-appgw"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "172.16.1.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-spoke-aks-vnet"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>